[
  {
    "id": "analisis-cuencas-hidrograficas-qgis",
    "slug": "analisis-cuencas-hidrograficas-qgis",
    "category": "Ingenieria de cuencas",
    "src": "/bannercuencas.webp",
    "name": "ANALISIS DE CUENCAS HIDROGRAFICAS CON QGIS",
    "titulo": "ANALISIS DE CUENCAS HIDROGRAFICAS CON QGIS",
    "descripcion": "Este curso tiene como objetivo principal formar profesionales y estudiantes en la aplicación de herramientas SIG avanzadas (QGIS) para el análisis hidrológico integral. ",
    "fechatext": "Disponible desde el lunes 16 de junio",
    "about": "Este curso tiene como objetivo principal formar profesionales y estudiantes en la aplicación de herramientas SIG avanzadas (QGIS) para el análisis hidrológico integral. Aprenderás a realizar la delimitación de cuencas hidrográficas, el cálculo preciso de parámetros morfométricos, la elaboración de balances hídricos preliminares y la generación de mapas temáticos especializados para la gestión de recursos hídricos. Fortalecerás tu competencia para desarrollar estudios técnicos en hidrología, empleando tecnologías geoespaciales con precisión y eficiencia para enfrentar problemáticas ambientales y de recursos hídricos.",
    "profesores": [
      {
        "nombre": "Eliser Mejía Herrera",
        "imagen": "/profesorcuencas.webp",
        "usuarioSocial": "@Eliser",
        "enlacePerfil": "https://www.linkedin.com/in/eliser-mej%C3%ADa-herrera-3892189b/"
      }
    ],
    "paraQuienEs": [
      "Para estudiantes y profesionales que quieran usar QGIS en el análisis de cuencas.",
      "Ideal para ingenieros, geógrafos e hidrólogos que trabajen con SIG.",
      "Perfecto si te interesa la gestión del agua con herramientas geoespaciales.",
      "Enfocado en quienes buscan aplicar QGIS al estudio de cuencas hidrográficas."
    ],
    "conocimientosPrevios": [
      "No se requiere experiencia previa con QGIS, aunque se recomienda tener conocimientos básicos en SIG o hidrología."
    ],
    "temarios": [
      {
        "title": "MÓDULO 1: INTRODUCCIÓN A SISTEMAS DE INFORMACIÓN GEOGRÁFICA (SIG) Y QGIS PARA CUENCAS HIDROGRÁFICAS",
        "items": [
          "1.1 - ¿Qué es un SIG y por qué es útil en el estudio de cuencas hidrográficas?",
          "1.2 - Principales componentes de un SIG",
          "1.3 - Visión general de QGIS y su ecosistema",
          "1.4 - Concepto de cuenca hidrográfica y su importancia en la gestión territorial",
          "1.6 - Interfaz de QGIS y exploración de herramientas clave",
          "1.7 - Descripción de elementos vectoriales y Ráster",
          "1.8 - Creación de elementos vectoriales",
          "1.9 - Edición de capas vectoriales",
          "1.10 - Calculadora de campos en QGIS"
        ]
      },
      {
        "title": "MÓDULO 2: MANEJO AVANZADO DE DATOS VECTORIALES Y RÁSTER EN QGIS",
        "items": [
          "2.1 - Tipos de geometría vectorial: puntos, líneas y polígonos",
          "2.2 - Estructura de atributos en capas vectoriales",
          "2.3 - Digitalización manual y edición de precisión",
          "2.4 - Conceptos clave en capas ráster: resolución espacial, píxeles, valor nulo",
          "2.5 - Corrección y reproyección de capas ráster",
          "2.6 - Práctica: Crear una capa vectorial desde cero para un área de estudio",
          "2.7 - Práctica: Uso del panel de atributos para gestionar datos",
          "2.8 - Práctica: Herramientas de edición avanzada en QGIS",
          "2.9 - Práctica: Añadir y unir imágenes ráster (mosaicos)"
        ]
      },
      {
        "title": "MÓDULO 3: FUENTES DE DATOS GEOESPACIALES Y SISTEMAS DE PROYECCIONES CARTOGRÁFICAS",
        "items": [
          "3.1 - Fuentes de datos geoespaciales para el estudio hidrológico",
          "3.2 - Proyecciones y sistemas de referencia espacial (EPSG, UTM, WGS84)",
          "3.3 - Consideraciones para trabajar con datos en estudios hidrológicos",
          "3.4 - Práctica: Descarga de datos del SRTM, Teselas de terreno o servicios geoespaciales nacionales",
          "3.5 - Práctica: Descarga de capas Shapefiles de entidades gubernamentales o repositorios libres",
          "3.6 - Práctica: Georreferenciación de una imagen ráster en QGIS",
          "3.7 - Práctica: Clipping y reproyección de una capa DEM para ajustarla al área de estudio",
          "3.8 - Práctica: Corrección de huecos en DEMs (Fill Sinks) para análisis hidrológico"
        ]
      },
      {
        "title": "MÓDULO 4: DELIMITACIÓN AUTOMÁTICA DE CUENCAS HIDROGRÁFICAS CON MODELOS DIGITALES DE ELEVACIÓN (DEM) EN QGIS",
        "items": [
          "4.1 - ¿Qué es un DEM y cómo se usa para análisis hidrológicos de cuencas?",
          "4.2 - Principios del análisis de redes de drenaje y vertientes",
          "4.3 - Algoritmos de llenado de depresiones (Fill Sinks) y dirección del flujo",
          "4.4 - Práctica: Uso del complemento GRASS o SAGA GIS en QGIS para delimitar una cuenca",
          "4.5 - Práctica: Procesamiento del DEM para análisis hidrológico: Fill sinks, Flow direction, Flow accumulation",
          "4.6 - Práctica: Generación del cauce principal y delimitación de la cuenca hidrográfica en QGIS"
        ]
      },

      {
        "title": "MÓDULO 5: ANÁLISIS MORFOMÉTRICO Y DETERMINACIÓN DE PARÁMETROS DE CUENCAS HIDROGRÁFICAS",
        "items": [
          "5.1 - Determinación de redes de drenaje y su clasificación (orden de Strahler)",
          "5.2 - Parámetros morfométricos básicos de cuencas: densidad de drenaje, pendiente media, etc.",
          "5.3 - Importancia de los parámetros morfométricos en la modelación hidrológica",
          "5.4 - Práctica: Generación de la red de drenaje a partir del DEM procesado en QGIS",
          "5.5 - Práctica: Determinación de parámetros morfológicos de la cuenca",
          "5.6 - Práctica: Medición de parámetros morfométricos con herramientas de QGIS (longitud de cauce, densidad de drenaje, pendiente)"
        ]
      },

      {
        "title": "MÓDULO 6: ELABORACIÓN DE MAPAS TEMÁTICOS PARA CUENCAS HIDROGRÁFICAS Y GENERACIÓN DE INFORMES TÉCNICOS",
        "items": [
          "6.1 - Elementos Cartográficos esenciales de un mapa temático",
          "6.2 - Buenas prácticas para presentación de mapas en informes técnicos",
          "6.3 - Estructura mínima de un informe de análisis espacial en SIG",
          "6.4 - Práctica: Composición de mapas con el diseñador de impresión de QGIS",
          "6.5 - Práctica: Inserción de leyendas, escalas, flecha de norte, y metadatos cartográficos",
          "6.6 - Práctica: Exportación de mapas en alta resolución y armado de un informe básico con resultados del curso"
        ]
      }
    ],
    "fecha": "2025-06-28T00:00:00",
    "learnings": [
      "Introducción y manejo básico de QGIS para análisis hidrológicos",
      "Manejo avanzado de datos vectoriales y ráster en QGIS",
      "Aplicación de sistemas de proyección cartográfica adecuados",
      "Elaboración de mapas temáticos profesionales para cuencas hidrográficas",
      "Generación de informes técnicos basados en análisis geoespaciales"
    ],
    "details": {
      "date": "16 junio 2025",
      "duration": "15 horas",
      "level": "Básico",
      "offer": "Mira las primeras clases gratis"
    },
    "remainingSeats": "52 estudiantes",
    "precio": 198.00,
    "descuento": 0.50
  }, 
 {
  "id": "hidrologia-aplicada-pisco-senamhi-qm",
  "slug": "hidrologia-aplicada-pisco-senamhi-qm",
  "category": "Hidrología Aplicada",
  "src": "/hidrologia-aplicada-con-pisco/banner.webp",
  "name": "Hidrología aplicada con PISCO, estaciones SENAMHI, Quantile Mapping en R",
  "titulo": "Hidrología aplicada con PISCO, estaciones SENAMHI, Quantile Mapping en R",
  "descripcion": "Curso intensivo donde aprenderás desde la carga de datos PISCO y SENAMHI hasta la simulación hidrológica en HEC-HMS, aplicando Quantile Mapping con R.",
  "fechatext": "Inicia el 25 de junio del 2025",
  "about": "Este curso te capacitará en la corrección de datos hidrometeorológicos mediante Quantile Mapping en R, el uso de PISCO y estaciones SENAMHI, y su aplicación en simulaciones hidrológicas distribuidas con HEC-HMS. Incluye desde la delimitación de cuencas en QGIS hasta la automatización de procesos en R, todo con datos reales.",
  "profesores": [
    {
      "nombre": "Rubén Omar Ortiz Vásquez",
      "imagen": "/hidrologia-aplicada-con-pisco/profesor.webp",
      "usuarioSocial": "@RubenOrtiz",
      "enlacePerfil": ""
    }
  ],
  "paraQuienEs": [
    "Profesionales y estudiantes interesados en modelación hidrológica aplicada.",
    "Ingenieros hidráulicos, civiles y ambientales que trabajen con PISCO y R.",
    "Técnicos en recursos hídricos que deseen simular cuencas con HEC-HMS.",
    "Personas que busquen una formación práctica con datos reales y herramientas profesionales."
  ],
  "conocimientosPrevios": [
    "Se recomienda conocimientos básicos de hidrología y manejo de software técnico como QGIS o R."
  ],
  "temarios": [
    {
      "title": "MÓDULO 01 – Demostración Práctica Inicial",
      "items": [
        "1.1 - Carga de datos PISCO y SENAMHI",
        "1.2 - Aplicación rápida de Quantile Mapping en R",
        "1.3 - Visualización de mejoras en los datos",
        "1.4 - Simulación rápida en HEC-HMS con datos corregidos",
        "1.5 - Carga de archivos reales",
        "1.6 - Corrección y visualización inmediata",
        "1.7 - Validación visual en HEC-HMS"
      ]
    },
    {
      "title": "MÓDULO 02 – Fundamentos y Exploración de Datos",
      "items": [
        "2.1 - ¿Qué es la hidrología aplicada?",
        "2.2 - Introducción a PISCO y cómo descargarlo",
        "2.3 - Estaciones SENAMHI: calidad y validación",
        "2.4 - Comparación preliminar en Excel/R",
        "2.5 - Revisión y graficado de datos",
        "2.6 - Cálculo de medias y correlación",
        "2.7 - Exploración de series históricas"
      ]
    },
    {
      "title": "MÓDULO 03 – Quantile Mapping con R",
      "items": [
        "3.1 - Fundamentos del Quantile Mapping",
        "3.2 - Uso de librerías: qmap, climQMBC, ggplot2",
        "3.3 - Aplicación paso a paso a una estación",
        "3.4 - Corrección diaria o mensual de series",
        "3.5 - Comparación antes y después de la corrección",
        "3.6 - Cálculo de NSE y RMSE",
        "3.7 - Visualización gráfica de resultados"
      ]
    },
    {
      "title": "MÓDULO 04 – Automatización y Exportación",
      "items": [
        "4.1 - Corrección de múltiples estaciones",
        "4.2 - Funciones personalizadas en R para automatizar",
        "4.3 - Exportación de resultados a CSV o TXT",
        "4.4 - Aplicación de Quantile Mapping a varias series",
        "4.5 - Automatización del proceso completo",
        "4.6 - Exportación estructurada de datos"
      ]
    },
    {
      "title": "MÓDULO 05 – Preparación de Insumos para HEC-HMS",
      "items": [
        "5.1 - Delimitación de cuenca con QGIS",
        "5.2 - Generación de hietogramas corregidos",
        "5.3 - Conversión de datos a formato .met para HEC-HMS",
        "5.4 - Recorte de datos PISCO corregidos por subcuenca",
        "5.5 - Generación de subcuencas para modelado",
        "5.6 - Creación de insumos meteorológicos"
      ]
    },
    {
      "title": "MÓDULO 06 – Simulación Hidrológica en HEC-HMS",
      "items": [
        "6.1 - Configuración del modelo distribuido en HEC-HMS",
        "6.2 - Carga de datos meteorológicos corregidos",
        "6.3 - Ejecución de la simulación hidrológica",
        "6.4 - Análisis y validación de resultados obtenidos",
        "6.5 - Construcción del modelo desde cero",
        "6.6 - Simulación comparativa con y sin corrección",
        "6.7 - Interpretación de resultados hidrológicos"
      ]
    }
  ],
  "fecha": "2025-06-25T00:00:00",
  "learnings": [
    "Aplicación de Quantile Mapping en R a datos PISCO y SENAMHI",
    "Automatización de procesos de corrección de datos",
    "Preparación de insumos hidrológicos para HEC-HMS",
    "Simulación hidrológica distribuida en HEC-HMS",
    "Delimitación de cuencas e insumos con QGIS"
  ],
  "details": {
    "date": "25 junio 2025",
    "duration": "12 horas (6 sesiones)",
    "level": "Intermedio",
    "offer": "Incluye bono, grabaciones, materiales y certificado de 120 horas"
  },
  "remainingSeats": "102 estudiantes",
  "precio": 199.00,
  "descuento": 0.5025
}
 

]
